renesas/ra-fsp-examples/example_projects/ek_ra8t2/freertos_tcp_dual_port/freertos_tcp_dual_port_ek_ra8t2_ep/e2studio/src/common_utils.h
/***********************************************************************************************************************
* Copyright (c) 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
***********************************************************************************************************************/

#ifndef COMMON_UTILS_H_
#define COMMON_UTILS_H_

/***********************************************************************************************************************
 * Includes
 **********************************************************************************************************************/
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>
#include "hal_data.h"

/***********************************************************************************************************************
 * Macro definitions
 **********************************************************************************************************************/
/* Macros for the terminal interface */
#if (USE_VIRTUAL_COM == 1)
  #include "SERIAL_TERM/serial.h"
  #define TERM_BUFFER_SIZE              (SERIAL_RX_MAX_SIZE)
  #define TERM_INIT()                   (serial_init())
  #define TERM_PRINTF(fmt, ...)         (serial_printf((fmt), ##__VA_ARGS__))
  #define TERM_READ(buf, len)           (serial_read((buf), (len)))
  #define TERM_HAS_DATA()               (serial_has_data())
  #define TERM_HAS_KEY()                (serial_has_key())
  #define TERM_DEINIT()                 (serial_deinit())
#else
  #include "SEGGER_RTT/SEGGER_RTT.h"
  #define SEGGER_INDEX                  (0)
  #define TERM_BUFFER_SIZE              (BUFFER_SIZE_DOWN)
  #define TERM_INIT()                   (0)
  #define TERM_PRINTF(fmt, ...)         (SEGGER_RTT_printf(SEGGER_INDEX, (fmt), ##__VA_ARGS__))
  #define TERM_READ(buf, len)           (SEGGER_RTT_Read(SEGGER_INDEX, (buf), (len)))
  #define TERM_HAS_DATA()               (SEGGER_RTT_HasData(SEGGER_INDEX))
  #define TERM_HAS_KEY()                (SEGGER_RTT_HasKey())
  #define TERM_DEINIT()                 /* No de-initialization needed for SEGGER RTT */
#endif /* USE_VIRTUAL_COM */

/* Macros for terminal functionality in the RTOS project */
#if (BSP_CFG_RTOS != 0U)
  #if (BSP_CFG_RTOS == 1U)
    #define TERM_BYTE_POOL_SIZE         (4096U)
  #endif /* BSP_CFG_RTOS == 1U */
  #define TERM_OUTPUT_QUEUE_SIZE        (100U)
  #define TERM_INPUT_QUEUE_SIZE         (100U)
#endif /* BSP_CFG_RTOS != 0U */

/* Macros commonly used */
#define LVL_ERR                         (1U)       /* Error conditions */
#define RESET_VALUE                     (0x00)
#define NULL_CHAR                       ('\0')
#define MODULE_CLOSE                    (0U)
#define EP_VERSION        ("1.0")
#define MODULE_NAME       "Ethernet using FreeRTOS+TCP"
#define BANNER_INFO       "\r\n********************************************************************************"\
                          "\r\n*   Renesas FSP Example Project for "MODULE_NAME" Module         *"\
                          "\r\n*   Example Project Version %s                                                *"\
                          "\r\n*   Flex Software Pack Version %d.%d.%d                                           *"\
                          "\r\n********************************************************************************"\
                          "\r\nRefer to the README.md for the Example Project documentation and              " \
                          "\r\nFSP User's Manual for more information about "MODULE_NAME"                    "\
                          "\r\n********************************************************************************\r\n"

#define ETH_PREINIT       "\r\n\r\n--------------------------------------------------------------------------------"\
                          "\r\nEthernet adapter Configuration for Renesas "KIT_NAME": Pre IP Init       "\
                          "\r\n--------------------------------------------------------------------------------\r\n\r\n"

#define ETH_POSTINIT      "\r\n\r\n--------------------------------------------------------------------------------"\
                          "\r\nEthernet adapter Configuration for Renesas "KIT_NAME": Post IP Init       "\
                          "\r\n--------------------------------------------------------------------------------\r\n\r\n"

#if defined (BOARD_RA6M3_EK) || defined (BOARD_RA6M3G_EK)
#define KIT_NAME                "EK-RA6M3"
#elif defined (BOARD_RA6M4_EK)
#define KIT_NAME                "EK-RA6M4"
#elif defined (BOARD_RA6M5_EK)
#define KIT_NAME                "EK-RA6M5"
#elif defined (BOARD_RA8M1_EK)
#define KIT_NAME                "EK-RA8M1"
#elif defined (BOARD_RA8D1_EK)
#define KIT_NAME                "EK-RA8D1"
#elif defined (BOARD_RA8T1_MCK)
#define KIT_NAME                "MCK-RA8T1"
#elif defined (BOARD_RA8P1_EK)
#define KIT_NAME                "EK-RA8P1"
#elif defined (BOARD_RA8T2_MCK)
#define KIT_NAME                "MCK-RA8T2"
#elif defined (BOARD_RA8M2_EK)
#define KIT_NAME                "EK-RA8M2"
#elif defined (BOARD_RA8T2_EK)
#define KIT_NAME                "EK-RA8T2"
#endif

#define APP_PRINT(fn_, ...)             (TERM_PRINTF((fn_), ##__VA_ARGS__))

#if LVL_ERR
  #define APP_ERR_PRINT(fn_, ...)       (APP_PRINT("\r\n[ERR] In Function: %s(), %s", __FUNCTION__, \
                                                   (fn_), ##__VA_ARGS__))
#else
  #define APP_ERR_PRINT(fn_, ...)
#endif /* LVL_ERR */

#define APP_ERR_RET(con, err, fn_, ...) ({\
                                        if (con)\
                                        {\
                                        APP_ERR_PRINT((fn_), ##__VA_ARGS__); \
                                        return (err); \
                                        }\
                                        })

#define ERROR_TRAP                      ({ \
                                        __asm("BKPT #0\n"); \
                                        })

#define APP_ERR_TRAP(err)               ({\
                                        if(err)\
                                        {\
                                        APP_PRINT("\r\nReturned Error Code: 0x%x  \r\n", (err));\
                                        TERM_DEINIT(); \
                                        /* Trap upon the error */ \
                                        ERROR_TRAP; \
                                        }\
                                        })

#define APP_READ(buf, len)              (TERM_READ(buf, len))

#define APP_CHECK_DATA                  (TERM_HAS_DATA())

#define APP_CHECK_KEY                   (TERM_HAS_KEY())

/***********************************************************************************************************************
 * Typedef definitions
 **********************************************************************************************************************/
/* Structure for exchanging information between application threads and the terminal thread */
#if (BSP_CFG_RTOS != 0U)
typedef struct st_term_msg
{
    uint32_t id;
    uint32_t size;
    uint32_t time;
    char msg[];
}term_msg_t;
#endif /* BSP_CFG_RTOS != 0U */

/***********************************************************************************************************************
 * Public function prototypes
 **********************************************************************************************************************/
/* Terminal API prototype for the RTOS project */
#if (BSP_CFG_RTOS != 0U)
void term_framework_init_check(void);
uint32_t term_framework_init(void);
uint32_t term_get_input_queue(char * p_msg, uint32_t * p_size, uint32_t wait);
uint32_t term_get_output_queue(void ** pp_msg_st, uint32_t wait);
uint32_t term_send_input_queue(uint32_t id, void * const p_data, uint32_t size);
uint32_t term_send_output_queue(uint32_t id, void * const p_data, uint32_t size);
#endif /* BSP_CFG_RTOS != 0U */

#endif /* COMMON_UTILS_H_ */
